{"data":[{"date":"2021-11-05T20:14:56.000Z","link":"http://saskatoonpolice.ca/news/2021594","title":"Missing Person - Edmonton Police Service Requesting Public Assistance","description":"At the request of the Edmonton Police Service, the Saskatoon Police Service is distributing the following: The Edmonton Police Service is seeking the public’s assistance in locating 66-year-old Augustin Moloi. Moloi may also use the first name Thabo and is originally from South Africa. He was initially reported missing to the Saskatoon Police Service by family outside of Canada. The Edmonton Police Service began investigating after it was determined that Moloi’s last known location was in Edmonton in July of 2007. He is known to frequent the downtown core, and may also have ties to Calgary and Saskatoon. Moloi is described as a black male with black hair and brown eyes who stands 5’4” and weighs 139lbs. The attached photos are from approximately 2003 (left) and 1990 (right). Anyone with information regarding Moloi’s whereabouts is asked to contact the Saskatoon Police Service at 306-975-8300 or the Edmonton Police Service at 1-780-423-4567. Anonymous information can also be submitted to Crime Stoppers at 1-800-222-8477. In an emergency, call 9-1-1. IMAGE"},{"date":"2021-11-05T19:32:00.000Z","link":"http://saskatoonpolice.ca/news/2021593","title":"Missing Person - Request for Public Assistance","description":"The Saskatoon Police Service is requesting assistance from the public in locating a missing 12-year-old. Destiny Alcrow was last seen at school, in the 300 block of Avenue N South, on November 3rd, 2021. Destiny is described as 4'10\" tall and 70 lbs. She has a pierced nose and was last seen wearing an Avocado Onesie. Anyone with information regarding the whereabouts of Destiny Alcrow is asked to contact the Saskatoon Police Service at 306-975-8300 or, in an emergency, 9-1-1. A photo is attached for distribution. (Occurrence Number: 21-119097) IMAGE"},{"date":"2021-11-04T21:34:14.000Z","link":"http://saskatoonpolice.ca/news/2021592","title":"Update: Arrest - Homicide - 500 Block Avenue X South","description":"A second suspect has been arrested in connection with this homicide investigation. On November 4th, 2021, a 20-year-old woman was arrested, without incident and has been charged with Second Degree Murder. Her first court appearance will be Friday morning. Police do not anticipate any further arrests. (Occurrence Number: 21-118460)"},{"date":"2021-11-04T14:56:23.000Z","link":"http://saskatoonpolice.ca/news/2021591","title":"Update: Suspicious Death / Homicide - 500 Block Avenue X South","description":"A 32-year-old Saskatoon woman has been charged with second degree murder in what is now the 7th homicide of 2021. She will be appearing in court this morning. The identity of the victim, a 52-year-old Saskatoon man, is not being released at the request of the family. The victim and accused are known to each other. (Court Information Number: 991178480) (Occurrence Number: 21-118460)"},{"date":"2021-11-03T01:22:16.000Z","link":"http://saskatoonpolice.ca/news/2021590","title":"Missing Person","description":"The Saskatoon Police Service is requesting the public's assistance in locating 13 year old D'Lila-Lily Northwest. D'Lila-Lily was last seen on November 1, 2021 at 9:30 p.m. She has light brown shoulder length hair, brown eyes and green braces. A photo is attached. Anyone with information on the whereabouts of D'Lila-Lily Northwest is asked to contact the Saskatoon Police Service at 306-975-8300. IMAGE"},{"date":"2021-11-02T15:42:47.000Z","link":"http://saskatoonpolice.ca/news/2021589","title":"Man arrested for six armed robberies following investigation ","description":"A 55-year-old man is facing 18 charges relating to six robberies following an investigation by the SPS General Investigations Section. Between October 17 and 26, 2021, police responded to six robberies that involved a weapon, at gas station convenience stores in the 2700 block of Faithful Avenue (x2), the 400 block of Circle Drive East, the 1900 block of McKercher Drive, the 3300 block of 8th Street East, and the 3900 block of 8th Street East. In each of the robberies, the suspect brandished a knife, but no one was injured. The accused was identified and arrested on October 27, 2021. He is facing numerous charges including Armed Robbery (x6), Possession of a Dangerous Weapon (x6), and Possession of Stolen Property (x6). (Court Info # 991177703) (Occurrence Number: 21-111798)"},{"date":"2021-11-02T13:21:23.000Z","link":"http://saskatoonpolice.ca/news/2021588","title":"Suspicious Death Investigation - 500 Block Ave. X S","description":"The SPS Major Crime Section, along with the Forensic Identification Section are investigating the death of an adult male. Just after 2:00 am, Tuesday morning, Nov. 2nd, 2021, police were called to a residence in the 500 block of Ave. X South. The deceased was found within the residence. The death is being treated as suspicious and the investigation is ongoing. More information will be released by the Major Crime Section when it becomes available. Anyone with any information related to this incident is asked to call the Saskatoon Police Service at 306-975-8300 or Saskatoon CrimeStoppers at 1-800-222-8477 (Occurrence Number: 21-118460)"},{"date":"2021-11-01T15:20:39.000Z","link":"http://saskatoonpolice.ca/news/2021587","title":"Arrest - Stabbing/Aggravated Assault - 100 Block 24th Street East","description":"The Saskatoon Police Service Serious Assault Unit has laid charges in a stabbing that occurred in the early hours of Sunday morning. At approximately 2:00 a.m., October 31, 2021, Patrol officers responded to a report that a person had been stabbed during an altercation in the 100 block of 24th Street East. The victim, a 23-year-old man, was located outside on the street and transported to hospital with serious injuries. This incident is not believed to be random and a 22-year-old man has been charged with Aggravated Assault. (Court Info # 991178072). (Occurrence Number: 21-117742)"},{"date":"2021-10-31T05:13:24.000Z","link":"http://saskatoonpolice.ca/news/2021586","title":"Missing Person - Request for Public Assistance ","description":"Saskatoon Police are requesting the assistance of the public in locating a 38 year old male. Rodrick Rabbitskin is described as being: 5'8\"tall, 180lbs, slim build, medium complexion, brown medium length hair, brown eyes, with pierced ears. He has the word \"Blessed\" tattooed on his left forearm. A Photo is attached for distribution. Police and family are concerned . Anyone with information on the whereabouts of Rodrick Rabbitskin is requested to contact the Saskatoon Police Service at 306-975-8300. (Occurrence Number: 21-115774) IMAGE"},{"date":"2021-10-29T18:00:05.000Z","link":"http://saskatoonpolice.ca/news/2021585","title":"Correction: Arrest - Aggravated Assault - 1100 Block Avenue W North","description":"Correction: The date of the incident should have read October 29th, 2021 (not the 21st as originally stated). (Occurrence Number: 21-116558)"},{"date":"2021-10-29T16:38:25.000Z","link":"http://saskatoonpolice.ca/news/2021583","title":"Arrest - Aggravated Assault - 1100 Block Avenue W North","description":"The Serious Assault Unit is investigating an aggravated assault that occurred early this morning. On October 21st, 2021, at around 2:30 a.m., Police were called to the 1100 block of Avenue W North, for a report of a man who had assaulted residents inside a building. Upon arrival officers located two victims, a 47-year-old man and a 49-year-old woman, suffering from serious but non-life-threatening injuries. Officers learned that a 54 year-old-man and the male victim had been involved in a physical altercation, which resulted in the 47-year-old man receiving a serious injury. The female victim had attempted to step in between the two and was also assaulted by the 54-year-old man. Both the 47-year-old man and 49-year-old woman were transported to hospital, with non-life threatening injuries. At approximately 2:45 a.m., officers located and arrested the 54-year-old suspect. He faces charges of Aggravated Assault and Assault. (Occurrence Number: 21-116558)"},{"date":"2021-10-28T21:59:18.000Z","link":"http://saskatoonpolice.ca/news/2021582","title":"Arrests - Drug Trafficking Investigation - 2000 Block Avenue B North","description":"The Saskatoon Police Service’s Drug Unit has completed an investigation that lead to the arrest of two men, who now face drug and weapons related charges. On October 22nd, 2021, at approximately 8 p.m., Police observed a 40-year-old man leaving a hotel in the 2000 block of Avenue B North. As part of the investigation, he was taken into custody by officers, without incident, and found to be in possession of methamphetamine and fentanyl. On October 23rd, 2021 at approximately 2:15 a.m. the Tactical Support Unit conducted a high risk warrant on a suite, in the same hotel. A 31-year-old man had barricaded himself inside the room, and upon entry was apprehended by the SPS K9 Unit. The man suffered injuries consistent with a dog bite and was transported to hospital for treatment. Upon searching the suite investigators seized the following: 422.0 grams of methamphetamine. 9.0 grams of fentanyl. 0.5 grams of cocaine. $740.00 cash A loaded firearm as well as an additional loaded spare magazine. The 31-year-old man has been charged with Possession for the Purposes of Trafficking x2 (Methamphetamine and Fentanyl), Possession of a Controlled Substance x3 (Methamphetamine, Fentanyl and Cocaine), Possession of the Proceeds of Crime, Possession of a Weapon for a Dangerous Purpose and multiple other firearms related charges. The 40-year-old man was charged with Possession of Methamphetamine and Fentanyl, Possession of a Weapon for a Dangerous Purpose and multiple other weapons related charges. (Court Information Numbers: 991177227, 991177224, 991177225, 991177222) (Occurrence Number: 21-112581)"},{"date":"2021-10-28T15:16:12.000Z","link":"http://saskatoonpolice.ca/news/2021581","title":"Arrest- Bear Spray/Assault with a Weapon - 3200 Block 33rd Street West ","description":"One man has been arrested after bear spray was used in a home on Wednesday night. On October 28th, 2021, at approximately 2:15 a.m., Police were called to the 3200 block of 33rd Street West for a report of bear spray being used inside a residence. When officers arrived on scene, they found five people suffering from the effects of bear spray, including two young children. Officers learned that a 23-year-old woman had been physically assaulted, by a 20-year-old man, who then bear sprayed the home. Medavie Health Services were able to assess the young children and adult victims. The victims and the suspect are believed to be known to each other. Upon searching the area, officers discovered the 20-year-old suspect trying to leave the area in a cab. He was arrested without incident. The 20-year-old faces charges of Assault with a Weapon (x4) and Assault. (Occurrence Number: 21-116200)"},{"date":"2021-10-28T09:47:05.000Z","link":"http://saskatoonpolice.ca/news/2021580","title":"Update- Missing Person Located","description":"Justin Partridge has been located and found to be safe. Police would like to thank the public for their assistance."},{"date":"2021-10-28T06:20:59.000Z","link":"http://saskatoonpolice.ca/news/2021579","title":"Missing Person-Request for Public Assistance","description":"Saskatoon Police are requesting the assistance of the public in locating a missing 11 year old boy. Justin Partridge was last seen on October 26, 2021 at 5:00 p.m. in the 200blk Ave P South. Justin is described as being 5'3\" tall, 130lbs, dark brown hair, brown eyes, and last seen wearing a grey Champion hoodie and black sweat pants. A picture is attached for distribution. Anyone with information on his whereabouts is requested to contact the Saskatoon Police Service at 306-975-8300. (Occurrence Number: 21-116152) IMAGE"}],"lastUpdated":"2021-11-05T21:02:42+00:00","references":[{"href":"https://saskatoonpolice.ca/rss/news","text":"saskatoonpolice.ca"}]}