{"data":[{"date":"2021-11-07T14:00:00.000Z","link":"https://www.cbc.ca/news/sask-cancer-patients-are-angry-at-scott-moe-and-the-unvaccinated-1.6238427?cmp=rss","title":"Sask. cancer patients are angry at Premier Scott Moe and the unvaccinated","description":"Saskatchewan cancer patients say they have been pushed into uncertainty as the province disrupted their treatments due to hospitals being packed with COVID-19 patients. They blame Premier Scott Moe and the unvaccinated."},{"date":"2021-11-07T09:00:00.000Z","link":"https://www.cbc.ca/news/politics/rcmp-body-worn-1.6236705?cmp=rss","title":"RCMP unlikely to meet deadline to equip Mounties with body-worn cameras","description":"The RCMP's plan to equip Mounties across the country with body-worn cameras is unlikely to meet its deadline."},{"date":"2021-11-06T23:47:45.000Z","link":"https://www.cbc.ca/news/canada/saskatchewan/saskatchewan-party-convention-scott-moe-1.6240195?cmp=rss","title":"Premier Moe receives seal of approval from party members at convention, leadership review","description":"Premier Scott Moe has received the approval he needed from Saskatchewan Party members at the party's convention in Saskatoon on Saturday."},{"date":"2021-11-06T20:44:07.000Z","link":"https://www.cbc.ca/news/canada/saskatchewan/173-new-cases-covid-19-sask-1.6240091?cmp=rss","title":"COVID-19 in Sask.: 3 more deaths, 173 new cases Saturday","description":"The province reported 173 new cases of COVID-19 and three more deaths from the illness Saturday."},{"date":"2021-11-06T10:00:00.000Z","link":"https://www.cbc.ca/news/canada/saskatchewan/sask-continues-to-rank-1st-in-covid-19-death-rates-across-canada-1.6239354?cmp=rss","title":"Sask. still has Canada's highest COVID-19 death rate, 5th wave a possibility: health authority","description":"At a physicians' town hall on Thursday night, the Saskatchewan Health Authority shared a slide showing that the COVID-19 death rate has plateaued in the last 14 days, but remains high."},{"date":"2021-11-06T18:57:20.000Z","link":"https://www.cbc.ca/news/canada/saskatchewan/trans-health-navigator-transgender-gender-diverse-health-care-1.6240044?cmp=rss","title":"Sask. pilot project helping trans, gender diverse people access health-care needs","description":"The TRANS Health Navigator project helps people who identify as transgender or gender diverse navigate health services, such as finding transgender-friendly doctors, getting referrals and finding support groups."},{"date":"2021-11-06T11:00:23.000Z","link":"https://www.cbc.ca/news/canada/saskatchewan/sask-party-convention-1.6238420?cmp=rss","title":"Premier Moe asks for support of party members ahead of convention and leadership review","description":"Premier Scott Moe will seek the support of Saskatchewan Party members at the party's convention in Saskatoon on Saturday."},{"date":"2021-11-06T14:55:54.000Z","link":"https://www.cbc.ca/news/canada/saskatchewan/sask-jobs-report-october-2021-1.6239582?cmp=rss","title":"Saskatchewan lost 6,500 jobs in October, StatsCan labour force survey says","description":"A new Statistics Canada report found Saskatchewan lost 6,500 jobs between September and October of this year."},{"date":"2021-11-06T00:39:04.000Z","link":"https://www.cbc.ca/news/canada/saskatchewan/indigenous-identity-fraud-protest-university-bourassa-1.6239557?cmp=rss","title":"Investigate faculty suspected of false Indigenous ancestry claims, group says following Bourassa revelations","description":"Dozens of Indigenous faculty, students, supporters and allies gathered Friday at the University of Saskatchewan to protest Indigenous identity fraud, after a CBC investigation found there was no evidence to support U of S health researcher Carrie Bourassa's claims to Indigenous ancestry."},{"date":"2021-11-06T05:37:34.000Z","link":"https://www.cbc.ca/sports/football/cfl/cfl-edmonton-elks-saskatchewan-roughriders-nov-5-1.6239661?cmp=rss","title":"Elks' rally falls short in historic home defeat to Roughriders","description":"Despite a furious fourth-quarter rally, a 19-17 loss to the Saskatchewan Roughriders on Friday condemned the Elks (2-9) to an 0-7 record at Commonwealth Stadium in 2021, which is an infamous achievement in a year when the team also rebranded with a new name."},{"date":"2021-11-06T08:00:00.000Z","link":"https://www.cbc.ca/news/health/covid-19-airborne-canada-masks-winter-1.6239322?cmp=rss","title":"COVID-19 spreads through the air. Here's what you can do about it this winter","description":"Canadians looking for guidance on how to reduce their risk of COVID-19 indoors this winter may be feeling left out in the cold. The Public Health Agency of Canada has stopped short of advocating for better-quality masks or saying outright that the virus is primarily airborne."},{"date":"2021-11-06T08:00:00.000Z","link":"https://www.cbc.ca/news/business/covid-19-pandemic-workplace-relationship-trends-1.6237153?cmp=rss","title":"Rethinking your relationship with work? So are a lot of people","description":"Experts say the broad changes sweeping through the work world pre-date the pandemic, but they're speeding up as a result of it."},{"date":"2021-11-05T20:00:39.000Z","link":"https://www.cbc.ca/news/canada/saskatoon/saskatchewan-covid-doctors-meeting-ministers-1.6238635?cmp=rss","title":"Sask. health ministers face doctors' questions about COVID response, privatization","description":"\"No one is calling Saskatchewan's response to the pandemic a success, except members of the current government,\" one doctor says."},{"date":"2021-11-05T20:33:55.000Z","link":"https://www.cbc.ca/news/canada/saskatchewan/covid-sask-november-5-2021-1.6239151?cmp=rss","title":"COVID-19 in Sask.: 141 new cases, 2 deaths Friday","description":"Saskatchewan is reporting 141 new cases of COVID-19 and two new deaths from the illness on Friday."},{"date":"2021-11-05T21:23:42.000Z","link":"https://www.cbc.ca/news/canada/saskatchewan/suma-income-support-letter-1.6238607?cmp=rss","title":"Saskatchewan Urban Municipalities Association voices concerns about province's revamped income support program","description":"Advocates say the province's new income support program is fueling evictions and homelessness. Now SUMA is voicing its concerns."},{"date":"2021-11-05T18:07:23.000Z","link":"https://www.cbc.ca/news/canada/saskatchewan/team-bourassa-statement-defending-career-built-on-merit-1.6238669?cmp=rss","title":"Statement defending Carrie Bourassa says her career was built on merit, not her claims to being Indigenous","description":"Carrie Bourassa says she didn’t take positions or funding from Indigenous people but built a career on merit."},{"date":"2021-11-05T17:13:37.000Z","link":"https://www.cbc.ca/news/canada/saskatchewan/corner-gas-grain-elevator-fire-1.6238606?cmp=rss","title":"Fire destroys iconic grain elevator from TV show Corner Gas","description":"The famous grain elevator in Rouleau, Sask. — known from the Canadian comedy show Corner Gas — burned to the ground Friday morning."},{"date":"2021-11-05T08:00:00.000Z","link":"https://www.cbc.ca/news/canada/saskatoon/residential-school-survivors-compensation-papal-visit-1.6237418?cmp=rss","title":"Residential school compensation must be paid before any papal visit, say survivors, advocates","description":"The potential $50 million to $100 million cost of a Canadian papal visit isn't far off the amount the Catholic Church still owes residential school survivors, say advocates."},{"date":"2021-11-05T13:38:30.000Z","link":"https://www.cbc.ca/news/canada/saskatchewan/humboldt-broncos-name-logo-trademark-1.6238234?cmp=rss","title":"Humboldt Broncos hockey club trademarks name, logo 3 years after bus crash","description":"The Humboldt Broncos Junior 'A' Hockey Club announced Wednesday that they had trademarked their name and logo to take back control of their brand following its widespread use following the tragic bus crash in 2018."},{"date":"2021-11-05T10:00:00.000Z","link":"https://www.cbc.ca/news/canada/saskatchewan/saskatoon-catholic-bishop-pens-open-letter-calling-vaccine-mandates-severe-1.6237245?cmp=rss","title":"Saskatoon Catholic bishop pens open letter calling vaccine mandates 'severe,' 'ethically questionable'","description":"A Saskatoon bishop wrote an open letter this week on what he calls the severity of vaccine mandates. He copied both the premier and the mayor of Saskatoon in the letter."}],"references":[{"href":"http://www.cbc.ca/cmlink/rss-canada-saskatoon","text":"CBC"}]}