{"data":[{"date":"2021-11-05T17:10:47.000Z","link":"https://www.ckom.com/2021/11/05/saskatoon-business-owner-welcomes-potential-creation-of-senior-zones/","title":"Saskatoon business owner welcomes potential creation of ‘senior zones’","description":"There's a steady stream of phone calls and customers at Sage Seniors' Resources at Market Mall in Saskatoon -- people looking for everything from walk..."},{"date":"2021-11-05T16:48:03.000Z","link":"https://www.ckom.com/2021/11/05/riders-looking-for-third-straight-win-in-showdown-with-elks/","title":"Riders looking for third straight win in showdown with Elks","description":"The Saskatchewan Roughriders will look to continue to build momentum &#8212; and get closer to a home playoff game &#8212; on Friday with the first of..."},{"date":"2021-11-05T16:38:47.000Z","link":"https://www.ckom.com/2021/11/05/the-great-outdoors-online-reservations-open-for-winter-camping/","title":"The great outdoors: Online reservations open for winter camping","description":"Saskatchewan residents who like camping year-round now can do just that in the province. On Friday, the provincial government said online reservations..."},{"date":"2021-11-05T16:23:27.000Z","link":"https://www.ckom.com/2021/11/05/hilltops-morrow-taking-a-bite-out-of-the-competition/","title":"Hilltops’ Morrow taking a bite out of the competition","description":"Saskatoon Hilltops defensive back Brant Morrow is used to exploiting cavities in opposing offences. Now he's looking to fill them. The fifth-year play..."},{"date":"2021-11-05T15:05:35.000Z","link":"https://www.ckom.com/2021/11/05/sha-employee-vaccine-program-to-start-this-month/","title":"SHA employee vaccine program to start this month","description":"This month, all Saskatchewan Health Authority employees will have to either be fully vaccinated against COVID-19 or submit to a testing program on the..."},{"date":"2021-11-05T14:52:00.000Z","link":"https://www.ckom.com/2021/11/05/corner-gas-grain-elevator-burns-to-the-ground/","title":"‘Corner Gas’ grain elevator burns to the ground","description":"An iconic grain elevator in Saskatchewan has been reduced to rubble. The grain elevator in Rouleau, located roughly 50 kilometres southwest of Regina,..."},{"date":"2021-11-05T12:48:25.000Z","link":"https://www.ckom.com/2021/11/05/nov-5-show-segments/","title":"Nov. 5 Show Segments","description":"8:30 - The Saskatchewan government is aiming to resume many of its suspended healthcare services this month, with many of the 860 workers moved to hel..."},{"date":"2021-11-05T12:34:51.000Z","link":"https://www.ckom.com/2021/11/05/jamie-nye-thankful-the-eichel-sabres-drama-is-now-over/","title":"Jamie Nye: Thankful the Eichel-Sabres drama is now over","description":"I couldn't imagine the relief that came yesterday for Jack Eichel and the Buffalo Sabres. Eichel was clearly done with being a Sabre and the Sabres we..."},{"date":"2021-11-04T23:00:52.000Z","link":"https://www.ckom.com/2021/11/04/huskies-off-the-leash-luncheon-returns/","title":"Huskies’ Off the Leash Luncheon returns","description":"The University of Saskatchewan Huskies men's hockey team held its annual Off the Leash Luncheon on Thursday at Prairieland Park. After being unable to..."},{"date":"2021-11-04T22:35:37.000Z","link":"https://www.ckom.com/2021/11/04/sask-govt-pondering-privatized-surgeries-to-reduce-wait-list/","title":"Sask. gov’t pondering privatized surgeries to reduce wait list","description":"The Government of Saskatchewan may have a plan to reduce its surgical wait list. On Thursday, the government said it might bring back a program that p..."}],"lastUpdated":"2021-11-05T18:11:23+00:00","references":[{"href":"http://www.ckom.com/feed/","text":"CKOM"}]}