{"data":[{"date":"2021-11-05T08:00:00.000Z","link":"https://www.cbc.ca/news/canada/saskatoon/residential-school-survivors-compensation-papal-visit-1.6237418?cmp=rss","title":"Residential school compensation must be paid before any papal visit, say survivors, advocates","description":"The potential $50 million to $100 million cost of a Canadian papal visit isn't far off the amount the Catholic Church still owes residential school survivors, say advocates."},{"date":"2021-11-05T13:38:30.000Z","link":"https://www.cbc.ca/news/canada/saskatchewan/humboldt-broncos-name-logo-trademark-1.6238234?cmp=rss","title":"Humboldt Broncos hockey club trademarks name, logo 3 years after bus crash","description":"The Humboldt Broncos Junior 'A' Hockey Club announced Wednesday that they had trademarked their name and logo to take back control of their brand following its widespread use following the tragic bus crash in 2018."},{"date":"2021-11-05T10:00:00.000Z","link":"https://www.cbc.ca/news/canada/saskatchewan/saskatoon-catholic-bishop-pens-open-letter-calling-vaccine-mandates-severe-1.6237245?cmp=rss","title":"Saskatoon Catholic bishop pens open letter calling vaccine mandates 'severe,' 'ethically questionable'","description":"A Saskatoon bishop wrote an open letter this week on what he calls the severity of vaccine mandates. He copied both the premier and the mayor of Saskatoon in the letter."},{"date":"2021-11-05T16:28:05.000Z","link":"https://www.cbc.ca/news/politics/canada-flags-remembrance-day-1.6238601?cmp=rss","title":"Assembly of First Nations calls on government to raise Canadian flags on government buildings","description":"The Assembly of First Nations has put forward what it calls a “solution” that would allow Ottawa to raise Canadian flags at federal government buildings to honour veterans on Remembrance Day while “continuing to grieve the genocide of Indigenous children.”"},{"date":"2021-11-05T11:54:29.000Z","link":"https://www.cbc.ca/news/canada/saskatchewan/canadian-medical-association-s-first-indigenous-president-preparing-to-make-change-1.6238176?cmp=rss","title":"Canadian Medical Association's first Indigenous president preparing to make change","description":"The first Indigenous president-elect of the Canadian Medical Association is hoping to change the culture of medicine in Canada."},{"date":"2021-11-05T11:00:00.000Z","link":"https://www.cbc.ca/news/canada/saskatchewan/vaccination-indigenous-youth-1.6237732?cmp=rss","title":"Vaxx Fest comes to Onion Lake, Sask., to encourage Indigenous youth to get vaccinated","description":"Vaxx Fest will take place in Onion Lake, Sask., this Friday and Saturday. It will feature music, social media influencers and giveaways."},{"date":"2021-11-05T10:00:00.000Z","link":"https://www.cbc.ca/news/canada/saskatoon/saskatchewan-health-authority-proof-of-vaccination-1.6237755?cmp=rss","title":"Sask. Health Authority moving ahead with mandatory COVID testing for at least 1,100 workers","description":"The number of workers needing testing could increase to up to 5,000 upon further review of employees' self-declarations, the health authority says."},{"date":"2021-11-05T11:00:00.000Z","link":"https://www.cbc.ca/news/canada/saskatchewan/first-person-sean-dunham-apartment-memories-1.6236964?cmp=rss","title":"The dingy apartment of my 20s left an indelible mark on me","description":"Everyone probably has that place they used to rent in their early 20s that stands out in their memory. You know the one. It’s where 90 per cent of your best stories happened."},{"date":"2021-11-05T02:28:26.000Z","link":"https://www.cbc.ca/news/canada/saskatchewan/saskatchewan-trespassing-penalties-1.6238046?cmp=rss","title":"Sask. to increase trespassing penalties to maximum of $25K fine, jail time for individuals","description":"Trespassers in Saskatchewan will soon be facing stiffer legal penalties, including the possibility of jail time."},{"date":"2021-11-04T22:12:33.000Z","link":"https://www.cbc.ca/news/canada/saskatoon/saskatchewan-government-covid-19-health-system-service-resumption-1.6237272?cmp=rss","title":"Sask. details 'aggressive' plan to restart health services delayed by 4th wave","description":"Hundreds of redeployed workers are about to get back to their old jobs."},{"date":"2021-11-04T23:56:20.000Z","link":"https://www.cbc.ca/news/canada/saskatchewan/yokrton-hospital-anti-vaccine-posters-1.6237883?cmp=rss","title":"Anti-vaccine signs posted at Sask. hospital an 'attack' on health-care workers: nurses union","description":"Numerous anti-vaccine posters that took aim at health-care workers were plastered around the Yorkton hospital, leading to outrage from provincial groups that represent them, as well as Premier Moe and the Saskatchewan Health Authority."},{"date":"2021-11-04T20:18:46.000Z","link":"https://www.cbc.ca/news/canada/saskatchewan/covid-sask-november-4-2021-1.6237455?cmp=rss","title":"COVID-19 in Sask.: 188 new cases, no new deaths Thursday","description":"Saskatchewan also reported 222 people in hospital with COVID-19 on Thursday, including 49 patients in intensive care. Another 24 COVID-19 patients from Saskatchewan were in ICUs outside of the province."},{"date":"2021-11-04T17:44:52.000Z","link":"https://www.cbc.ca/news/canada/saskatoon/moose-crash-sylvia-fedoruk-school-1.6237194?cmp=rss","title":"Moose crashes through window of Sylvia Fedoruk School in Saskatoon","description":"A moose on the loose in Saskatoon smashed through a window of an elementary school Thursday."},{"date":"2021-11-04T16:13:27.000Z","link":"https://www.cbc.ca/news/canada/saskatoon/women-charged-with-2nd-degree-murder-1.6236984?cmp=rss","title":"2 women charged with 2nd-degree murder in Saskatoon's 7th homicide of year","description":"Two Saskatoon women, ages 20 and 32, are charged with second-degree murder in connection with a suspicious death Tuesday."},{"date":"2021-11-04T22:55:03.000Z","link":"https://www.cbc.ca/news/canada/manitoba/saskatchewan-missing-people-manitoba-police-1.6237756?cmp=rss","title":"Police ask for help finding 2 missing people from Sask. heading to Manitoba","description":"Jake Laliberte and Natasha McLean were last seen in Île-à-la-Crosse, Sask., on Oct. 18. They indicated they were traveling to Steinbach, Man., but family have not heard from them since, RCMP say."},{"date":"2021-11-04T19:14:09.000Z","link":"https://www.cbc.ca/news/canada/saskatchewan/missing-boaters-wollaston-lake-search-cancelled-1.6237314?cmp=rss","title":"Search for missing boaters in northeastern Sask. cancelled due to ice on Wollaston Lake","description":"A search and rescue mission involving several organizations that was set to begin Wednesday was called off because of weather conditions on Wollaston Lake."},{"date":"2021-11-04T08:00:00.000Z","link":"https://www.cbc.ca/news/canada/saskatchewan/opinion-chris-andersen-indigenous-identity-fraud-1.6236018?cmp=rss","title":"Indigenous identity fraud is encouraged in academia. Here's how to change that","description":"The revelations about Dr. Carrie Bourassa’s claims to Indigeneity were, in retrospect, not especially surprising to those of us who research Indigenous identity."},{"date":"2021-11-04T17:33:45.000Z","link":"https://www.cbc.ca/news/canada/saskatoon/man-guilty-assault-race-based-2020-attack-1.6237120?cmp=rss","title":"Saskatoon man guilty of assault in race-based 2020 attack on Asian teen","description":"A Saskatoon man is guilty of assault in an unprovoked attack last year on an Asian teen in a city park."},{"date":"2021-11-04T12:16:57.000Z","link":"https://www.cbc.ca/news/canada/saskatchewan/most-covid-19-nursing-home-deaths-in-saskatchewan-happened-in-private-facilities-1.6236653?cmp=rss","title":"Most COVID-19 nursing home deaths in Saskatchewan happened in private facilities","description":"Of the people who died in the pandemic, 62 occurred in private, non-profit homes; 45 occurred in private for-profit homes; and 47 occurred in homes run by the health authority."},{"date":"2021-11-04T15:34:39.000Z","link":"https://www.cbc.ca/news/canada/saskatoon/demonstration-u-sask-call-investigations-indigenous-identity-fraud-1.6236767?cmp=rss","title":"Demonstration planned at U of Sask. to call for investigations into Indigenous identity fraud","description":"A group is planning a peaceful demonstration on the University of Saskatchewan campus to demand investigations into staff and faculty who may be misrepresenting their Indigenous background at colleges across the country."}],"lastUpdated":"2021-11-05T16:45:06+00:00","references":[{"href":"http://www.cbc.ca/cmlink/rss-canada-saskatoon","text":"www.cbc.ca"}]}