{"data":[{"date":"2021-11-05T17:41:00.000Z","link":"https://saskatoon.ctvnews.ca/saskatoon-bishop-urges-caution-with-covid-19-vaccine-mandates-1.5654054","title":"Saskatoon bishop urges caution with COVID-19 vaccine mandates","description":"Saskatoon's most senior Catholic leader says while he's supportive of public health measures, he's concerned COVID-19 vaccine mandates could veer into \"ethically questionable\" territory."},{"date":"2021-11-05T14:41:32.000Z","link":"https://saskatoon.ctvnews.ca/police-searching-for-inmate-who-escaped-sask-healing-lodge-1.5653735","title":"Police searching for inmate who escaped Sask. healing lodge ","description":"Police are looking for a man who escaped from a federal correctional facility west of Duck Lake"},{"date":"2021-11-05T22:27:00.000Z","link":"https://saskatoon.ctvnews.ca/sask-first-nation-holds-vaxx-fest-to-boost-vaccination-rates-1.5654591","title":"Sask. First Nation holds Vaxx Fest to boost vaccination rates","description":"Onion Lake Cree Nation is hosting an event called Vaxx Fest to raise vaccination rates."},{"date":"2021-11-05T20:30:00.000Z","link":"https://regina.ctvnews.ca/sask-reports-death-of-covid-19-patient-transferred-to-ont-1.5654410","title":"Sask. reports death of COVID-19 patient transferred to Ont.","description":"The Saskatchewan government confirmed 141 new cases of COVID-19 on Friday, along with the death of a COVID-19 patient who was transferred to Ontario."},{"date":"2021-11-05T00:01:00.000Z","link":"https://saskatoon.ctvnews.ca/saskatoon-lawyer-makes-jump-to-fsin-to-advocate-for-indigenous-people-1.5653077","title":"Saskatoon lawyer makes jump to FSIN to advocate for Indigenous people","description":"Aly Bear aims to use her legal knowledge to advocate for Indigenous people on a bigger platform after being elected third vice-chief of the Federation of Sovereign Indigenous Nations."},{"date":"2021-11-05T21:22:13.000Z","link":"https://saskatoon.ctvnews.ca/lifetime-of-dishonest-acts-final-arguments-heard-in-saskatoon-forcible-confinement-sexual-assault-trial-1.5654468","title":"'Lifetime of dishonest acts': Final arguments heard in Saskatoon forcible confinement, sexual assault trial","description":"Closing arguments were heard in the trial of Joseph Yaremko, who is charged with sexual assault with a weapon and forcible confinement."},{"date":"2021-11-05T18:14:53.000Z","link":"https://regina.ctvnews.ca/sask-mayors-raise-concerns-about-provincial-income-support-program-1.5654136","title":"Sask. mayors raise concerns about provincial income support program","description":"Saskatchewan city mayors say they’re concerned about challenges faced by people on the new Saskatchewan Income Support (SIS) program."},{"date":"2021-11-05T18:06:00.000Z","link":"https://saskatoon.ctvnews.ca/humboldt-broncos-trademark-name-and-logo-1.5654079","title":"Humboldt Broncos trademark name and logo","description":"The Humboldt Broncos hockey club trademarked its name and logo."},{"date":"2021-11-05T01:53:00.000Z","link":"https://www.ctvnews.ca/world/2-dead-in-dramatic-shootout-near-upscale-mexican-resorts-1.5653258","title":"2 dead in dramatic shootout near upscale Mexican resorts","description":"A commando of drug gang gunmen on Thursday stormed ashore at a beach on Mexico's resort-studded Caribbean coast in front of luxury hotels and executed two drug dealers from a rival gang."},{"date":"2021-11-05T23:00:41.000Z","link":"https://saskatoon.ctvnews.ca/saskatoon-hindu-community-shows-support-for-victims-in-bangladesh-1.5654679","title":"Saskatoon Hindu community shows support for victims in Bangladesh","description":"Dozens from the Saskatoon Hindu community gathered at City Hall to show support for people affected by recent attacks in Bangladesh."}],"references":[{"href":"http://saskatoon.ctvnews.ca/rss/Saskatoon","text":"CTV"}]}