{"data":[{"date":"2021-11-03T18:51:43.000Z","link":"https://www.cbc.ca/news/canada/saskatchewan/6-people-treated-monoclonal-antibodies-1.6235694?cmp=rss","title":"Sask. has treated 6 people with monoclonal antibodies for COVID-19, despite hundreds of available doses","description":"Only six people with COVID-19 have been treated with monoclonal antibodies, despite the province having hundreds of doses on hand."},{"date":"2021-11-03T19:03:50.000Z","link":"https://www.cbc.ca/news/canada/saskatoon/justin-ballantyne-to-stand-trial-2nd-degree-murder-1.6235767?cmp=rss","title":"Justin Ballantyne to stand trial for 2nd-degree murder in 2020 shooting of Brandon Applegate","description":"A man accused of second-degree murder in the 2020 shooting of Brandon Applegate is going to stand trial."},{"date":"2021-11-03T20:13:04.000Z","link":"https://www.cbc.ca/news/canada/saskatoon/kirby-wirchenko-moving-on-13-years-broadway-theatre-1.6235902?cmp=rss","title":"Kirby Wirchenko moving on after 13 years at helm of Saskatoon's Broadway Theatre","description":"Over more than a decade, Kirby Wirchenko has watched as the Broadway Theatre changed from primarily an art house movie theatre to a lively events venue."},{"date":"2021-11-03T10:00:00.000Z","link":"https://www.cbc.ca/news/canada/saskatchewan/m%C3%A9tis-nation-saskatchewan-indigenous-self-identification-1.6234749?cmp=rss","title":"What does it take to be Métis in Saskatchewan?","description":"Métis Nation-Saskatchewan, the government representing Métis citizens in Saskatchewan, is reiterating that Indigenous self-identification is not enough in the wake of revelations about Carrie Bourassa's claims to Indigenous ancestry. It is encouraging eligible Métis people to apply to become official citizens through its provincial citizenship registry."},{"date":"2021-11-03T15:39:54.000Z","link":"https://www.cbc.ca/news/canada/saskatoon/treaty-boundary-signage-coming-highways-1.6235381?cmp=rss","title":"Treaty boundary signage coming to Sask. highways","description":"The Government of Saskatchewan has agreed to place highway signs marking treaty boundaries across the province."},{"date":"2021-11-03T12:45:14.000Z","link":"https://www.cbc.ca/news/canada/saskatoon/saskatoon-police-searching-for-missing-13-year-old-girl-1.6235262?cmp=rss","title":"Saskatoon police searching for missing 13-year-old girl","description":"Police in Saskatoon are asking for the public's help in finding D'Lila-Lily Northwest."},{"date":"2021-11-03T10:00:00.000Z","link":"https://www.cbc.ca/news/canada/saskatchewan/sask-government-to-look-into-creating-provincial-police-force-for-the-2nd-time-1.6234231?cmp=rss","title":"Sask. government to look into creating provincial police force for the 2nd time","description":"In the Saskatchewan government's throne speech last Wednesday, the province voiced its intention to look into creating a provincial police force."},{"date":"2021-11-03T10:00:00.000Z","link":"https://www.cbc.ca/news/canada/saskatoon/covid-19-vaccine-fraud-saskatchewan-pharmacies-1.6234522?cmp=rss","title":"Sask. residents paid others to get fraudulently vaccinated in their name, pharmacist group says","description":"Vaccine fraud has occurred in Saskatchewan, with an unspecified number of people paying others to get vaccinated under their name, using their health cards, according to a professional body representing pharmacists in the province. The province says it will investigate the alleged vaccine fraud."},{"date":"2021-11-03T08:00:00.000Z","link":"https://www.cbc.ca/news/opinion/opinion-cop26-collective-dissociation-fight-or-flight-1.6230113?cmp=rss","title":"On climate change, we're just playing dead and hoping the predator goes away","description":"How is it that people leading corporations and governments aren’t fighting, not just for their own ability to sustain life, but for the reassurance that their kids and grandkids have that same opportunity, asks family physician and trauma therapist Dr. Christine Gibson."},{"date":"2021-11-02T21:12:48.000Z","link":"https://www.cbc.ca/news/canada/saskatchewan/covid-fines-november-2-1.6234630?cmp=rss","title":"Sask. issues several fines for COVID-19 public health order violations","description":"Saskatchewan public health inspectors issued several fines last week to people and businesses in violation of the province’s COVID-19 public health orders."},{"date":"2021-11-02T20:42:06.000Z","link":"https://www.cbc.ca/news/canada/saskatchewan/covid-sask-november-2-2021-1.6234416?cmp=rss","title":"COVID-19 in Sask.: Active cases drop for 12th straight day","description":"The province reports 107 new confirmed cases of COVID-19 on Tuesday, along with five more deaths from the illness."},{"date":"2021-11-02T19:57:57.000Z","link":"https://www.cbc.ca/news/canada/saskatoon/tribal-council-planning-emergency-shelter-1.6234401?cmp=rss","title":"Saskatoon Tribal Council planning emergency shelter to deal with homelessness crisis","description":"Tribal Chief Mark Arcand says he doesn't want to see tent cities in Saskatoon this winter."},{"date":"2021-11-03T08:00:00.000Z","link":"https://www.cbc.ca/news/science/healthcare-emissions-1.6234268?cmp=rss","title":"Swap your inhaler, skip the laughing gas: How patients can help curb health-care emissions","description":"Experts estimate the health-care sector contributes about five per cent of Canada's greenhouse gas emissions. So what can patients and medical providers do to cut back?"},{"date":"2021-11-02T20:51:57.000Z","link":"https://www.cbc.ca/news/canada/saskatoon/covid-19-saskatchewan-fourth-wave-surgial-backlog-1.6234364?cmp=rss","title":"Sask. could take more than a year to catch up on some delayed surgeries, health authority says","description":"Though planning is underway to address the backlog, it could take more than a year to catch up on some surgeries delayed by the fourth wave of COVID-19, the Saskatchewan Health Authority says."},{"date":"2021-11-02T19:44:22.000Z","link":"https://www.cbc.ca/news/canada/saskatoon/unexpected-twist-joseph-yaremko-sexual-assault-trial-1.6234283?cmp=rss","title":"Unexpected twist at Joseph Yaremko sexual assault trial in Saskatoon","description":"Joseph Yaremko is going to make his own final arguments at his Saskatoon sexual assault and unlawful confinement trial."},{"date":"2021-11-02T20:30:19.000Z","link":"https://www.cbc.ca/news/canada/saskatchewan/regina-saskatoon-return-international-flights-1.6234428?cmp=rss","title":"International flights coming back to Regina, Saskatoon airports","description":"Starting Nov. 30, the Regina and Saskatoon airports will be welcoming back international flights"},{"date":"2021-11-02T18:49:29.000Z","link":"https://www.cbc.ca/news/community-members-say-they-are-displeased-at-carrie-bourassa-1.6234213?cmp=rss","title":"Carrie Bourassa's suspension 'bittersweet,' says Métis professor who brought complaint to U of S","description":"Caroline Tait, a Métis professor at the University of Saskatchewan who raised concerns about prominent academic Carrie Bourassa's claims to Indigenous ancestry, says the school's recent decision to put Bourassa on leave is a step in the right direction as tenured professors have a responsibility to tell the truth."},{"date":"2021-11-02T13:44:24.000Z","link":"https://www.cbc.ca/news/canada/saskatchewan/sask-johnson-and-johnson-covid-vaccines-1.6233841?cmp=rss","title":"Sask. government expecting shipment of Johnson & Johnson vaccines: health minister","description":"The Saskatchewan government is hoping to receive ‘an allotment’ of the one-shot Johnson & Johnson vaccine by the end of the month, according to Health Minister Paul Merriman."},{"date":"2021-11-02T17:45:32.000Z","link":"https://www.cbc.ca/news/business/u-s-land-border-vaccinated-1.6233944?cmp=rss","title":"U.S. will allow land entry again as soon as border crossings open on Nov. 8","description":"U.S. Customs and Border Protection confirmed travellers entering by land will not have to show proof of a negative COVID-19 test, but said they should be prepared to verbally attest to their vaccination status, and present their vaccination documentation upon request."},{"date":"2021-11-02T17:53:54.000Z","link":"https://www.cbc.ca/news/canada/saskatoon/council-committee-endorses-year-round-school-zones-1.6234229?cmp=rss","title":"Saskatoon council committee endorses year-round school zones, new playground zones","description":"Drivers may need to watch their speed around schools and playgrounds if a proposal is passed at Saskatoon city council."}],"lastUpdated":"2021-11-03T20:19:47+00:00","references":[{"href":"http://www.cbc.ca/cmlink/rss-canada-saskatoon","text":"www.cbc.ca"}]}