{"data":[{"date":"2021-11-05T23:23:16.000Z","link":"https://regina.ctvnews.ca/sask-doctors-air-frustrations-with-health-minister-warn-of-potential-fifth-wave-of-covid-19-1.5654734","title":"Sask. doctors air frustrations with health minister, warn of potential fifth wave of COVID-19","description":"Saskatchewan physicians are warning the provincial government of a potential fifth wave of COVID-19 if more measures are not introduced."},{"date":"2021-11-05T13:21:00.000Z","link":"https://www.ctvnews.ca/health/coronavirus/children-under-12-now-account-for-highest-number-of-new-covid-19-infections-in-canada-phac-1.5653533","title":"Children under 12 now account for highest number of new COVID-19 infections in Canada: PHAC","description":"Canadians under the age of 12 now account for the highest number of new COVID-19 infections, the Public Health Agency of Canada says. Speaking at a press conference on Friday, Chief Public Health Officer Dr. Theresa Tam said those under 12 currently represent over 20 per cent of daily cases."},{"date":"2021-11-05T17:41:00.000Z","link":"https://saskatoon.ctvnews.ca/saskatoon-bishop-urges-caution-with-covid-19-vaccine-mandates-1.5654054","title":"Saskatoon bishop urges caution with COVID-19 vaccine mandates","description":"Saskatoon's most senior Catholic leader says while he's supportive of public health measures, he's concerned COVID-19 vaccine mandates could veer into \"ethically questionable\" territory."},{"date":"2021-11-05T22:27:00.000Z","link":"https://saskatoon.ctvnews.ca/sask-first-nation-holds-vaxx-fest-to-boost-vaccination-rates-1.5654591","title":"Sask. First Nation holds Vaxx Fest to boost vaccination rates","description":"Onion Lake Cree Nation is hosting an event called Vaxx Fest to raise vaccination rates."},{"date":"2021-11-05T21:34:31.000Z","link":"https://www.ctvnews.ca/climate-and-environment/wind-and-solar-power-could-meet-most-electricity-demands-of-major-countries-study-says-1.5654485","title":"Wind and solar power could meet most electricity demands of major countries, study says","description":"Most of the electricity demand in advanced, industrialized nations can be met with a combination of wind and solar power, according to a recent study, but contingency measures may be necessary in order to fully satisfy requirements."},{"date":"2021-11-05T00:01:00.000Z","link":"https://saskatoon.ctvnews.ca/saskatoon-lawyer-makes-jump-to-fsin-to-advocate-for-indigenous-people-1.5653077","title":"Saskatoon lawyer makes jump to FSIN to advocate for Indigenous people","description":"Aly Bear aims to use her legal knowledge to advocate for Indigenous people on a bigger platform after being elected third vice-chief of the Federation of Sovereign Indigenous Nations."},{"date":"2021-11-05T21:22:13.000Z","link":"https://saskatoon.ctvnews.ca/lifetime-of-dishonest-acts-final-arguments-heard-in-saskatoon-forcible-confinement-sexual-assault-trial-1.5654468","title":"'Lifetime of dishonest acts': Final arguments heard in Saskatoon forcible confinement, sexual assault trial","description":"Closing arguments were heard in the trial of Joseph Yaremko, who is charged with sexual assault with a weapon and forcible confinement."},{"date":"2021-11-05T23:08:54.000Z","link":"https://saskatoon.ctvnews.ca/university-of-sask-faculty-staff-rally-against-indigenous-identity-fraud-1.5654694","title":"University of Sask. faculty, staff rally against Indigenous identity fraud","description":"More than 100 people gathered outside the University of Saskatchewan (U of S) on Friday to protest against Indigenous identity fraud."},{"date":"2021-11-05T20:30:00.000Z","link":"https://regina.ctvnews.ca/sask-reports-death-of-covid-19-patient-transferred-to-ont-1.5654410","title":"Sask. reports death of COVID-19 patient transferred to Ont.","description":"The Saskatchewan government confirmed 141 new cases of COVID-19 on Friday, along with the death of a COVID-19 patient who was transferred to Ontario."},{"date":"2021-11-05T14:41:32.000Z","link":"https://saskatoon.ctvnews.ca/police-searching-for-inmate-who-escaped-sask-healing-lodge-1.5653735","title":"Police searching for inmate who escaped Sask. healing lodge ","description":"Police are looking for a man who escaped from a federal correctional facility west of Duck Lake"}],"references":[{"href":"http://saskatoon.ctvnews.ca/rss/Saskatoon","text":"CTV"}]}