{"data":[{"date":"2021-11-07T17:22:00.000Z","link":"https://saskatoon.ctvnews.ca/university-of-saskatchewan-huskies-punch-ticket-to-canada-west-semis-1.5655813","title":"University of Saskatchewan Huskies’ punch ticket to Canada West semis","description":"The University of Saskatchewan Huskies football team ended its regular season schedule with a win over the Calgary Dinos at Griffiths Stadium."},{"date":"2021-11-07T02:01:00.000Z","link":"https://www.ctvnews.ca/canada/mixed-reaction-from-residential-school-survivors-after-announcement-of-papal-visit-1.5655563","title":"Mixed reaction from residential school survivors after announcement of papal visit","description":"There's mixed reaction among residential school survivors after the Pope agreed to visit Canada. While many survivors want the apology that is due to them, others are questioning the cost of the visit."},{"date":"2021-11-07T16:55:07.000Z","link":"https://saskatoon.ctvnews.ca/saskatoon-firefighters-respond-to-submerged-vehicle-near-highway-16-boychuck-drive-1.5655784","title":"Saskatoon firefighters respond to submerged vehicle near Highway 16, Boychuck Drive","description":"Saskatoon firefighters searched a small body of water in the city Sunday morning after a vehicle drove off the road."},{"date":"2021-11-07T16:43:57.000Z","link":"https://www.ctvnews.ca/business/canadian-grocery-shoppers-warned-to-expect-several-months-of-rockiness-as-food-prices-rise-1.5655778","title":"Canadian grocery shoppers warned to expect 'several months of rockiness' as food prices rise","description":"Canadians are likely to see inflated food prices at their local grocery stores for several more months, some experts say."},{"date":"2021-11-06T20:02:58.000Z","link":"https://regina.ctvnews.ca/172-new-covid-19-cases-3-deaths-reported-in-sask-1.5655259","title":"172 new COVID-19 cases, 3 deaths reported in Sask. ","description":"The Government of Saskatchewan reported 173 new COVID-19 cases on Saturday, along with three more deaths."},{"date":"2021-11-06T16:14:00.000Z","link":"https://saskatoon.ctvnews.ca/premier-moe-receives-over-80-support-in-leadership-review-at-sask-party-convention-1.5655150","title":"Premier Moe receives over 80% support in leadership review at Sask. Party convention","description":"Premier Scott Moe received over 80 per cent support from a Saskatchewan Party member’s vote during its convention at TCU Place in Saskatoon on Saturday."},{"date":"2021-11-05T23:23:00.000Z","link":"https://regina.ctvnews.ca/sask-doctors-air-frustrations-with-health-minister-warn-of-potential-fifth-wave-of-covid-19-1.5654734","title":"Sask. doctors air frustrations with health minister, warn of potential fifth wave of COVID-19","description":"Saskatchewan physicians are warning the provincial government of a potential fifth wave of COVID-19 if more measures are not introduced."},{"date":"2021-11-07T00:53:00.000Z","link":"https://bc.ctvnews.ca/tornado-watch-briefly-issued-after-waterspout-sighted-near-vancouver-airport-1.5655537","title":"Tornado watch briefly issued after waterspout sighted near Vancouver airport","description":"Environment Canada issued a rare tornado watch for Metro Vancouver and the Howe Sound region Saturday evening."},{"date":"2021-11-06T16:17:00.000Z","link":"https://edmonton.ctvnews.ca/edmonton-elks-go-winless-at-home-this-season-fall-19-17-to-saskatchewan-roughriders-1.5655152","title":"Edmonton Elks go winless at home this season, fall 19-17 to Saskatchewan Roughriders","description":"The Edmonton Elks will finish a CFL season without a win at home for the first time in the team's 72-year history."},{"date":"2021-11-05T13:21:00.000Z","link":"https://www.ctvnews.ca/health/coronavirus/children-under-12-now-account-for-highest-number-of-new-covid-19-infections-in-canada-phac-1.5653533","title":"Children under 12 now account for highest number of new COVID-19 infections in Canada: PHAC","description":"Canadians under the age of 12 now account for the highest number of new COVID-19 infections, the Public Health Agency of Canada says. Speaking at a press conference on Friday, Chief Public Health Officer Dr. Theresa Tam said those under 12 currently represent over 20 per cent of daily cases."}],"references":[{"href":"http://saskatoon.ctvnews.ca/rss/Saskatoon","text":"CTV"}]}