{"data":[{"date":"2021-11-03T01:22:16.000Z","link":"http://saskatoonpolice.ca/news/2021590","title":"Missing Person","description":"The Saskatoon Police Service is requesting the public's assistance in locating 13 year old D'Lila-Lily Northwest.  D'Lila-Lily was last seen on November 1, 2021 at 9:30 p.m.  She has light brown shoulder length hair, brown eyes and green braces.  A photo is attached.  Anyone with information on the whereabouts of D'Lila-Lily Northwest is asked to contact the Saskatoon Police Service at 306-975-8300.  \r\n  IMAGE"},{"date":"2021-11-02T15:42:47.000Z","link":"http://saskatoonpolice.ca/news/2021589","title":"Man arrested for six armed robberies following investigation ","description":"A 55-year-old man is facing 18 charges relating to six robberies following an investigation by the SPS General Investigations Section.  Between October 17 and 26, 2021, police responded to six robberies that involved a weapon, at gas station convenience stores in the 2700 block of Faithful Avenue (x2), the 400 block of Circle Drive East, the 1900 block of McKercher Drive, the 3300 block of 8th Street East, and the 3900 block of 8th Street East. In each of the robberies, the suspect brandished a knife, but no one was injured.  The accused was identified and arrested on October 27, 2021. He is facing numerous charges including Armed Robbery (x6), Possession of a Dangerous Weapon (x6), and Possession of Stolen Property (x6).  (Court Info # 991177703)  (Occurrence Number: 21-111798)"},{"date":"2021-11-02T13:21:23.000Z","link":"http://saskatoonpolice.ca/news/2021588","title":"Suspicious Death Investigation - 500 Block Ave. X S","description":"The SPS Major Crime Section, along with the Forensic Identification Section are investigating the death of an adult male.  Just after 2:00 am, Tuesday morning, Nov. 2nd, 2021, police were called to a residence in the 500 block of Ave. X South.  The deceased was found within the residence. The death is being treated as suspicious and the investigation is ongoing.   More information will be released by the Major Crime Section when it becomes available.  Anyone with any information related to this incident is asked to call the Saskatoon Police Service at 306-975-8300 or Saskatoon CrimeStoppers at 1-800-222-8477  (Occurrence Number: 21-118460)"},{"date":"2021-11-01T15:20:39.000Z","link":"http://saskatoonpolice.ca/news/2021587","title":"Arrest - Stabbing/Aggravated Assault - 100 Block 24th Street East","description":"The Saskatoon Police Service Serious Assault Unit has laid charges in a stabbing that occurred in the early hours of Sunday morning.  At approximately 2:00 a.m., October 31, 2021, Patrol officers responded to a report that a person had been stabbed during an altercation in the 100 block of 24th Street East. The victim, a 23-year-old man, was located outside on the street and transported to hospital with serious injuries.  This incident is not believed to be random and a 22-year-old man has been charged with Aggravated Assault. (Court Info # 991178072).  (Occurrence Number: 21-117742)"},{"date":"2021-10-31T05:13:24.000Z","link":"http://saskatoonpolice.ca/news/2021586","title":"Missing Person - Request for Public Assistance ","description":"Saskatoon Police are requesting the assistance of the public in locating a 38 year old male.  Rodrick Rabbitskin is described as being: 5'8\"tall, 180lbs, slim build, medium complexion, brown medium length hair, brown eyes, with pierced ears. He has the word \"Blessed\" tattooed on his left forearm. A Photo is attached for distribution.  Police and family are concerned . Anyone with information on the whereabouts of Rodrick Rabbitskin is requested to contact the Saskatoon Police Service at 306-975-8300.  (Occurrence Number: 21-115774)  \r\n  IMAGE"},{"date":"2021-10-29T18:00:05.000Z","link":"http://saskatoonpolice.ca/news/2021585","title":"Correction: Arrest - Aggravated Assault - 1100 Block Avenue W North","description":"Correction:  The date of the incident should have read October 29th, 2021 (not the 21st as originally stated).  (Occurrence Number: 21-116558)"},{"date":"2021-10-29T16:38:25.000Z","link":"http://saskatoonpolice.ca/news/2021583","title":"Arrest - Aggravated Assault - 1100 Block Avenue W North","description":"The Serious Assault Unit is investigating an aggravated assault that occurred early this morning.  On October 21st, 2021, at around 2:30 a.m., Police were called to the 1100 block of Avenue W North, for a report of a man who had assaulted residents inside a building.  Upon arrival officers located two victims, a 47-year-old man and a 49-year-old woman, suffering from serious but non-life-threatening injuries.   Officers learned that a 54 year-old-man and the male victim had been involved in a physical altercation, which resulted in the 47-year-old man receiving a serious injury.  The female victim had attempted to step in between the two and was also assaulted by the 54-year-old man.   Both the 47-year-old man and 49-year-old woman were transported to hospital, with non-life threatening injuries.  At approximately 2:45 a.m., officers located and arrested the 54-year-old suspect.  He faces charges of Aggravated Assault and Assault.  (Occurrence Number: 21-116558)"},{"date":"2021-10-28T21:59:18.000Z","link":"http://saskatoonpolice.ca/news/2021582","title":"Arrests - Drug Trafficking Investigation - 2000 Block Avenue B North","description":"The Saskatoon Police Service’s Drug Unit has completed an investigation that lead to the arrest of two men, who now face drug and weapons related charges.  On October 22nd, 2021, at approximately 8 p.m., Police observed a 40-year-old man leaving a hotel in the 2000 block of Avenue B North.  As part of the investigation, he was taken into custody by officers, without incident, and found to be in possession of methamphetamine and fentanyl.   On October 23rd, 2021 at approximately 2:15 a.m. the Tactical Support Unit conducted a high risk warrant on a suite, in the same hotel.  A 31-year-old man had barricaded himself inside the room, and upon entry was apprehended by the SPS K9 Unit.  The man suffered injuries consistent with a dog bite and was transported to hospital for treatment.   Upon searching the suite investigators seized the following:      422.0 grams of methamphetamine.    9.0 grams of fentanyl.    0.5 grams of cocaine.    $740.00 cash    A loaded firearm as well as an additional loaded spare magazine.       The 31-year-old man has been charged with Possession for the Purposes of Trafficking x2 (Methamphetamine and Fentanyl), Possession of a Controlled Substance x3 (Methamphetamine, Fentanyl and Cocaine), Possession of the Proceeds of Crime, Possession of a Weapon for a Dangerous Purpose and multiple other firearms related charges.  The 40-year-old man was charged with Possession of Methamphetamine and Fentanyl, Possession of a Weapon for a Dangerous Purpose and multiple other weapons related charges.  (Court Information Numbers: 991177227, 991177224, 991177225, 991177222)  (Occurrence Number: 21-112581)"},{"date":"2021-10-28T15:16:12.000Z","link":"http://saskatoonpolice.ca/news/2021581","title":"Arrest- Bear Spray/Assault with a Weapon - 3200 Block 33rd Street West ","description":"One man has been arrested after bear spray was used in a home on Wednesday night.  On October 28th, 2021, at approximately 2:15 a.m., Police were called to the 3200 block of 33rd Street West for a report of bear spray being used inside a residence.  When officers arrived on scene, they found five people suffering from the effects of bear spray, including two young children.  Officers learned that a 23-year-old woman had been physically assaulted, by a 20-year-old man, who then bear sprayed the home.  Medavie Health Services were able to assess the young children and adult victims.  The victims and the suspect are believed to be known to each other.   Upon searching the area, officers discovered the 20-year-old suspect trying to leave the area in a cab.  He was arrested without incident.   The 20-year-old faces charges of Assault with a Weapon (x4) and Assault.   (Occurrence Number: 21-116200)"},{"date":"2021-10-28T09:47:05.000Z","link":"http://saskatoonpolice.ca/news/2021580","title":"Update- Missing Person Located","description":"Justin Partridge has been located and found to be safe.  Police would like to thank the public for their assistance."},{"date":"2021-10-28T06:20:59.000Z","link":"http://saskatoonpolice.ca/news/2021579","title":"Missing Person-Request for Public Assistance","description":"Saskatoon Police are requesting the assistance of the public in locating a missing 11 year old boy.  Justin Partridge was last seen on October 26, 2021 at 5:00 p.m. in the 200blk Ave P South.   Justin is described as being 5'3\" tall, 130lbs, dark brown hair, brown eyes, and last seen wearing a grey Champion hoodie and black sweat pants.  A picture is attached for distribution.  Anyone with information on his whereabouts is requested to contact the Saskatoon Police Service at 306-975-8300.   (Occurrence Number: 21-116152)  \r\n  IMAGE"},{"date":"2021-10-27T16:04:07.000Z","link":"http://saskatoonpolice.ca/news/2021578","title":"Arrest - Imitation Firearm Discharged at Residence, Police - 1300 Block Avenue D North","description":"One man is facing charges after an imitation firearm was discharged at a residence and in the direction of responding police officers.  Shortly before 7:00 p.m. on October 26, 2021, Police responded to the 1300 block of Avenue D North for a report of pellets being fired at a residence. Officers were in the process of locating damage from the alleged shooting when multiple pellets were then fired in their direction, narrowly missing them; taking cover, the officers determined that the shots were being fired from a second floor window of a residence on the same block.  Subsequent investigation resulted in the arrest of a 57 year-old Saskatoon man and the seizure of a break action air rifle with a telescopic scope. The man is facing numerous firearms-related charges in addition to charges relating to assault with a weapon and mischief. There were no injuries reported as a result of this occurrence.   (Court Information Number: 991177622)   (Occurrence Number: 21-115734)"},{"date":"2021-10-26T21:03:22.000Z","link":"http://saskatoonpolice.ca/news/2021577","title":"Barricaded Person - 900 Block Avenue I South","description":"A 29 year old male was taken into custody and transported to Royal University Hospital for treatment following an incident in the 900 block of Avenue I South this afternoon.  Police were called to a home at that location at approximately 12:30 p.m., October 26, 2021.  It was reported that a man in the residence had been acting violently and had threatened to harm himself.  It was also reported that he may have access to weapons. Outside, officers attempted to make contact with the man.   He began damaging items in the home,  lighting items on fire and throwing them out the window.  Members of the Tactical Support Unit who were on duty were able to make entry into the home and take the man into custody around 1:50 p.m.  No one was injured during the incident.    (Occurrence Number: 21-115619)"},{"date":"2021-10-26T20:13:12.000Z","link":"http://saskatoonpolice.ca/news/2021576","title":"One Arrested/Armed Robbery/Warrant for Murder - 2600 Block Broadway Ave/60 Block Rita Cres.","description":"Saskatoon Police have arrested an 18 year old male in connection with an armed robbery that occurred on October 22, 2021.  While investigating the robbery the SPS Guns and Gangs Unit was able to determine that the suspect was wanted by the Regina Police Service for first degree murder.  At approximately 10:00 p.m., October 22nd, Police were called to a business in the 2600 block of Broadway Avenue.  A staff member reported that two armed men had entered the store, demanded cash and fled the scene.  Investigation led to a home on Rita Crescent where officers believed the suspect may be located.  At approximately 1:00 p.m., October 25, 2021, members of the Guns and Gangs Unit and members of the Tactical Support Unit attended to a garage behind the home.  The suspect was apprehended a few hours later after a small fire was set inside the garage.    The 18 year old male is facing charges in Saskatoon of Armed Robbery, Using a Firearm While Committing An Indictable Offence and Possession of a Firearm While Prohibited From Doing So.    It is anticipated that the accused will be transported to Regina later this week to appear in Provincial Court on the First-Degree Murder charge.    Court information # 991177432.   (Occurrence Number: 21-114192)"},{"date":"2021-10-26T16:27:48.000Z","link":"http://saskatoonpolice.ca/news/2021575","title":"Injured Man - 1000 Block Boychuk Drive ","description":"A 26 year old male is recovering from his injury following a report of an injured person in the 1000 block of Boychuk Drive.  At approximately 10:00 p.m., Police received a call from the man who reported having been shot.  Upon arrival Police located the man behind a strip mall.  He was transported to hospital by Medavie Health Services where it was found that he was suffering from a serious but non-life threatening gunshot wound.  It is not known where the incident took place or what type of firearm or pellet gun was used.    Anyone with information regarding this incident is asked to contact the Saskatoon Police Service at 306-975-8300 or Crime Stoppers at 1-800-222-8477.  (Occurrence Number: 21-115412)"}],"lastUpdated":"2021-11-03T15:29:59+00:00","references":[{"href":"https://saskatoonpolice.ca/rss/news","text":"saskatoonpolice.ca"}]}